tutorials/verificationAndValidation/radiation-delete/1-cylindrical-enclosure-Dua-Cheng-1975/2-axisymmetric/setups.orig/common/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2301                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantPimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1e-5;

deltaT          1e-5;

writeControl    adjustableRunTime;

writeInterval   1e-5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  16;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.7;

maxDi           0.25;

maxDeltaT       0.01;

functions
{
    sets1
    {
        type                sets;
        libs                (sampling);
        interpolationScheme cellPoint;
        setFormat           raw;
        executeControl      onEnd;
        writeControl        onEnd;

        fields              ( qr );

        _plane
        {
            type            patchEdge;
            axis            z;
            patches         ( pipe );
            surfaceType     plane;
            planeType       pointAndNormal;
            origin          ( 1 0 0 );
        }

        sets
        {
            // Intersections of patches with plane
            z
            {
                ${_plane}
                pointAndNormalDict
                {
                    point  ( 0 0 1 );
                    normal ( 0 1 0 );
                }
            }
        }
    }
}

// ************************************************************************* //
